[
  {
    "id": "portfolio",
    "name": "Portafolio Web – SPA Interactivo",
    "description": "Este proyecto nació con una idea clara: crear un espacio donde pudiera mostrar mi trabajo y evolución como desarrolladora, reflejando mi interés por la interacción, animaciones y pequeños detalles. Construido como una SPA desde cero con HTML, CSS y JavaScript modular, implementé routing propio, modo oscuro/claro, animaciones personalizadas y carga dinámica de proyectos desde un JSON. El resultado es un portafolio moderno, fluido y completamente interactivo.",
    "stack": [
      "🌐 HTML5",
      "🎨 CSS3",
      "⚡ JavaScript (ES6+)",
      "🌀 SPA con routing (router.js)",
      "💡 Animaciones personalizadas (animations.js)",
      "🌙 Dark/Light mode toggle (theme.js)",
      "🖼️ JSON dinámico (projects.json)"
    ],
    "features": [
      {
        "title": "SPA Interactiva",
        "demo_gif": "assets/gifs/spa-interactiva.gif"
      },
      {
        "title": "Dark/Light mode",
        "demo_gif": "assets/gifs/dark-light-mode.gif"
      },
      {
        "title": "Animaciones y microinteracciones",
        "demo_gif": "assets/gifs/animaciones.gif"
      },
      {
        "title": "Carga dinámica de proyectos",
        "demo_gif": "assets/gifs/carga-proyectos.gif"
      }
    ],
    "images": [
      "assets/portfolio1.png",
      "assets/portfolio2.png"
    ],
    "demo": "https://taniaarteaga.github.io/tania-portfolio",
    "code": "https://github.com/taniaarteaga/tania-portfolio",
    "retos": "Renderizar contenido dinámico sin recargar la página, mantener SPA modularizada y crear un sistema propio de routing. Implementar animaciones suaves y modo oscuro/claro sin afectar la performance.",
    "aprendizajes": "Modularización de JavaScript, gestión de rutas sin frameworks y arquitectura limpia en un proyecto SPA desde cero.",
    "futuras_funcionalidades": "Agregar backend para contacto, soporte multilenguaje e integración con CMS para actualizar proyectos dinámicamente."
  },
  {
    "id": "super-m",
    "name": "SuperM – React E-commerce",
    "description": "SuperM surgió como el proyecto final de mi primer curso de React, pero lo llevé más allá creando un e-commerce moderno con React, Vite y Supabase. Los usuarios pueden registrarse, iniciar sesión, agregar productos al carrito persistente, editar sus datos y usar esos datos para autocompletar el formulario de envío. Implementé Context API, TanStack Query y microinteracciones para mejorar la experiencia, además de checkout simulado y filtros dinámicos de productos.",
    "stack": [
      "⚛️ React",
      "⚡ Vite",
      "🎨 CSS Modules",
      "🔗 Context API",
      "📊 TanStack Query",
      "🗄️ Supabase"
    ],
    "features": [
      {
        "title": "Carrito persistente",
        "demo_gif": "assets/gifs/toast.mp4"
      },
      {
        "title": "Autocompletado del formulario de envío",
        "demo_gif": "assets/gifs/toast.mp4"
      },
      {
        "title": "Filtros y ordenamiento",
        "demo_gif": "assets/gifs/toast.mp4"
      },
      {
        "title": "Checkout simulado",
        "demo_gif": "assets/gifs/toast.mp4"
      },
      {
        "title": "Resumen del pedido",
        "demo_gif": "assets/gifs/toast.mp4"
      },
      {
        "title": "Notificaciones tipo toast",
        "demo_gif": "assets/gifs/toast.mp4"
      }
    ],
    "images": [
      "assets/superm1.png",
      "assets/superm2.png"
    ],
    "demo": "https://superm.vercel.app",
    "code": "https://github.com/taniaarteaga/superm",
    "retos": "El mayor reto fue implementar filtros y ordenamiento de productos. La base de datos del curso no podía modificarse, así que creé una nueva estructura en Supabase con los elementos necesarios. Además, los filtros debían adaptarse al diseño responsive como menú desplegable, y sincronizar correctamente con el estado global y la UI.",
    "aprendizajes": "Estado global con Context API, consultas asíncronas con TanStack Query, manejo de carrito persistente en localStorage, autocompletado de formularios con datos del usuario, diseño de filtros dinámicos y responsive.",
    "futuras_funcionalidades": "Integrar sistema de pagos real, panel de administración para productos y mejoras en UI/UX y performance."
  },
  {
    "id": "social-app",
    "name": "Red Social – Full-Stack App",
    "description": "Este proyecto nació de un curso avanzado de React, enfocándome en mejorar el frontend y adaptarlo a necesidades reales. Usé la API del curso, modificando solo lo necesario: añadí endpoints para likes y simulé la eliminación de avatars en frontend. Construí un frontend con React, Vite, React Router y TanStack React Query, y un backend con Node.js, Express y MongoDB Atlas, logrando una red social funcional con publicaciones, comentarios, seguidores y feed dinámico.",
    "stack": [
      "⚛️ React",
      "⚡ Vite",
      "🛠 Node.js",
      "📦 Express",
      "🗄 MongoDB",
      "🔑 JWT",
      "🎨 CSS3",
      "🧩 React Router",
      "📊 TanStack React Query"
    ],
    "features": [
      {
        "title": "Registro y login",
        "demo_gif": "assets/gifs/registro-login.gif"
      },
      {
        "title": "Feed dinámico de publicaciones",
        "demo_gif": "assets/gifs/feed.gif"
      },
      {
        "title": "Likes y comentarios",
        "demo_gif": "assets/gifs/likes-comentarios.gif"
      },
      {
        "title": "Gestión de usuarios y seguidores",
        "demo_gif": "assets/gifs/usuarios-seguidores.gif"
      },
      {
        "title": "Edición de perfil y avatar",
        "demo_gif": "assets/gifs/perfil-avatar.gif"
      }
    ],
    "images": [
      "assets/social1.png",
      "assets/social2.png"
    ],
    "demo": "https://social-demo.vercel.app",
    "code": "https://github.com/taniaarteaga/social-media-app",
    "retos": "Consumir la API del curso en lugar de Supabase, adaptar endpoints para likes, simular eliminación de avatars en frontend, unificar rutas con parámetros opcionales y mantener la aplicación escalable y reactiva con hooks personalizados y React Query.",
    "aprendizajes": "Trabajo con React Router Outlet, rutas unificadas con parámetros opcionales, Blob URLs, exponer index en dominios para facilitar imports, uso de git stash y cherry-pick, modularización de hooks y componentes, manejo avanzado de estado con React Query.",
    "futuras_funcionalidades": "Notificaciones en tiempo real, panel de administración, filtros y búsqueda avanzada de usuarios, y mejoras de rendimiento en el feed."
  }
]